export const accentMap: Record<string, string> = {
    // A
    À: 'A', Á: 'A', Â: 'A', Ã: 'A', Ä: 'A', Å: 'A',
    Ā: 'A', Ă: 'A', Ą: 'A',
    à: 'a', á: 'a', â: 'a', ã: 'a', ä: 'a', å: 'a',
    ā: 'a', ă: 'a', ą: 'a',
  
    // B
    Ḃ: 'B', Ɓ: 'B', ḃ: 'b', ɓ: 'b',
  
    // C
    Ç: 'C', Ć: 'C', Ĉ: 'C', Ċ: 'C', Č: 'C',
    ç: 'c', ć: 'c', ĉ: 'c', ċ: 'c', č: 'c',
  
    // D
    Ď: 'D', Đ: 'D',
    ď: 'd', đ: 'd',
  
    // E
    È: 'E', É: 'E', Ê: 'E', Ë: 'E',
    Ē: 'E', Ĕ: 'E', Ė: 'E', Ę: 'E', Ě: 'E',
    è: 'e', é: 'e', ê: 'e', ë: 'e',
    ē: 'e', ĕ: 'e', ė: 'e', ę: 'e', ě: 'e',
  
    // F
    Ƒ: 'F', ƒ: 'f',
  
    // G
    Ĝ: 'G', Ğ: 'G', Ġ: 'G', Ģ: 'G',
    ĝ: 'g', ğ: 'g', ġ: 'g', ģ: 'g',
  
    // H
    Ĥ: 'H', Ħ: 'H',
    ĥ: 'h', ħ: 'h',
  
    // I
    Ì: 'I', Í: 'I', Î: 'I', Ï: 'I',
    Ĩ: 'I', Ī: 'I', Ĭ: 'I', Į: 'I', İ: 'I',
    ì: 'i', í: 'i', î: 'i', ï: 'i',
    ĩ: 'i', ī: 'i', ĭ: 'i', į: 'i', ı: 'i',
  
    // J
    Ĵ: 'J', ĵ: 'j',
  
    // K
    Ķ: 'K', ķ: 'k',
  
    // L
    Ĺ: 'L', Ļ: 'L', Ľ: 'L', Ŀ: 'L', Ł: 'L',
    ĺ: 'l', ļ: 'l', ľ: 'l', ŀ: 'l', ł: 'l',
  
    // M
    Ḿ: 'M', ḿ: 'm',
  
    // N
    Ñ: 'N', Ń: 'N', Ņ: 'N', Ň: 'N',
    ñ: 'n', ń: 'n', ņ: 'n', ň: 'n',
  
    // O
    Ò: 'O', Ó: 'O', Ô: 'O', Õ: 'O', Ö: 'O', Ø: 'O',
    Ō: 'O', Ŏ: 'O', Ő: 'O',
    ò: 'o', ó: 'o', ô: 'o', õ: 'o', ö: 'o', ø: 'o',
    ō: 'o', ŏ: 'o', ő: 'o',
  
    // P
    Ƥ: 'P', ƥ: 'p',
  
    // R
    Ŕ: 'R', Ŗ: 'R', Ř: 'R',
    ŕ: 'r', ŗ: 'r', ř: 'r',
  
    // S
    Ś: 'S', Ŝ: 'S', Ş: 'S', Š: 'S', Ș: 'S',
    ś: 's', ŝ: 's', ş: 's', š: 's', ș: 's',
  
    // T
    Ţ: 'T', Ť: 'T', Ŧ: 'T', Ț: 'T',
    ţ: 't', ť: 't', ŧ: 't', ț: 't',
  
    // U
    Ù: 'U', Ú: 'U', Û: 'U', Ü: 'U',
    Ũ: 'U', Ū: 'U', Ŭ: 'U', Ů: 'U', Ű: 'U', Ų: 'U',
    ù: 'u', ú: 'u', û: 'u', ü: 'u',
    ũ: 'u', ū: 'u', ŭ: 'u', ů: 'u', ű: 'u', ų: 'u',
  
    // W
    Ŵ: 'W', ŵ: 'w',
  
    // Y
    Ý: 'Y', Ŷ: 'Y', Ÿ: 'Y',
    ý: 'y', ŷ: 'y', ÿ: 'y',
  
    // Z
    Ź: 'Z', Ż: 'Z', Ž: 'Z',
    ź: 'z', ż: 'z', ž: 'z',
  
    // Special Characters
    Æ: 'AE', æ: 'ae',
    Œ: 'OE', œ: 'oe',
    ẞ: 'SS', ß: 'ss',
    Þ: 'Th', þ: 'th',
    Ƿ: 'W', ƿ: 'w',
    Ȝ: 'Y', ȝ: 'y',
  };